/*
 * AAUTasks.strings
 * MacConfig
 */
 
/*  AAUPortMapFirewallTask  */
"Firewall" = "Porttitaulukon käyttöönottoapuri";
"Firewall.Service.Intro" = "Porttitaulukon käyttöönottoapuri auttaa ohjaamaan sisäänpäin tulevan verkkoliikenteen omassa verkossa oleviin tiettyihin portteihin tai palvelimiin.";
"Firewall.PortHost.Intro" = "Valitse palvelu valikosta tai syötä julkinen ja yksityinen IP-osoite ja portit, jotka haluat ohjata toisiinsa.";
"Firewall.PortHost.IPv6" = "Voit myös sallia saapuvan verkkoliikenteen kaikkiin verkossa oleviin IPv6-palvelimiin.";
"Firewall.Description.Intro" = "Syötä kuvaus tälle porttitaulukon tietueelle.";
"Firewall.Description.Done" = "Kun olet valmis, tallenna porttitaulukon tietue osoittamalla Valmis.";

"tcpPrivatePorts" = "Yksityiset TCP-portit";
"tcpPublicPorts" = "Julkiset TCP-portit";
"udpPrivatePorts" = "Yksityiset UDP-portit";
"udpPublicPorts" = "Julkiset UDP-portit";

"type" = "Palvelu";
"hosts" = "Yksityinen IP-osoite";
"privatePort" = "Yksityinen portti";
"description" = "Kuvaus";
"advertiseService" = "Mainosta Bonjourilla";
"serviceName" = "Palvelun nimi";
"serviceType" = "Palvelun tyyppi";
"allowAllIPv6" = "Salli liikenne kaikkiin IPv6-palvelimiin";

"ConflictingPortNumber" = "Julkisen portin numero on ristiriidassa tukiaseman jonkin palvelun käyttämän portin kanssa. Valitse toinen julkisen portin numero.";/*TO BE REMOVED*/
"ConflictingPortUDP" = "Julkisen UDP-portin numero on ristiriidassa tukiaseman jonkin palvelun käyttämän portin kanssa. Valitse toinen julkisen portin numero.";
"ConflictingPortUDPFileSharing" = "Julkisen UDP-portin numero on ristiriidassa tukiaseman tiedostonjakoportin kanssa. Estä tiedostonjako tai valitse toinen porttinumero.";
"ConflictingPortUDPFileSharingNoDisable" = "Julkisen UDP-portin numero on ristiriidassa tukiaseman tiedostonjakoportin kanssa. Valitse toinen porttinumero.";
"ConflictingPortUDPSNMP" = "Julkinen UDP-portti on ristiriidassa tukiaseman SNMP-portin kanssa. Estä SNMP tai valitse toinen porttinumero.";
"ConflictingPortTCPFileSharing" = "Julkisen TCP-portin numero on ristiriidassa tukiaseman tiedostonjakoportin kanssa. Estä tiedostonjako tai valitse toinen porttinumero.";
"ConflictingPortTCPFileSharingNoDisable" = "Julkisen TCP-portin numero on ristiriidassa tukiaseman tiedostonjakoportin kanssa. Valitse toinen porttinumero.";
"ConflictingPortTCPACP" = "Julkisen TCP-portin numero on ristiriidassa tukiaseman määrittelyportin kanssa. Valitse toinen porttinumero.";

/* Services */
"Personal File Sharing" = "Tiedostonjako";
"Windows Sharing" = "Windows-jako";
"Personal Web Sharing" = "Henkilökohtainen verkkojako";
"Remote Login - SSH" = "Etäkirjautuminen - SSH";
"FTP Access" = "FTP-pääsy";
"Apple Remote Desktop" = "Apple Remote Desktop";
"Remote Apple Events" = "Apple Event -etäkomennot";
"Printer Sharing" = "Tulostinjako";
"POP Mail" = "POP-posti";
"POP Mail with SSL" = "POP-posti SSL:n kautta";
"IMAP Mail" = "IMAP-posti";
"IMAP Mail with SSL" = "IMAP-posti SSL:n kautta";
"SMTP Mail" = "SMTP-posti";
"QuickTime Streaming Server" = "QuickTime Streaming Server";
"Jabber" = "Jabber";
"CustomService" = "Valitse palvelu";

/*  AAUIPv6FirewallTask  */

"IPv6Firewall" = "IPv6-palomuurin käyttöönottoapuri";
"IPv6Firewall.Intro" = "IPv6-palomuurin käyttöönottoapuri auttaa sallimaan sisääntulevaa IPv6-verkkoliikennettä verkkosi laitteisiin.";

"AllowLabel" = "Salli";
"AllowAll" = "Kaikki palvelut ja portit";
"AllowAllTCPUDP" = "Kaikki TCP- ja UDP-portit";
"AllowSpecific" = "Tietyt TCP- ja UDP-portit";

"host" = "IPv6-osoite";
"tcpPorts" = "TCP-portit";
"udpPorts" = "UDP-portit";

/*  AAUUserDBTask  */

"Accounts" = "Tilinluontiapuri";
"Accounts.UserPassword" = "Käyttäjätunnus ja salasana";
"Accounts.UserPassword.Intro" = "Syötä käyttäjätunnus ja salasana.";
"Accounts.Restrictions.FileAccess" = "Valitse tämän tilin oikeudet jaettuihin levyihin.";

"name" = "Nimi";
"shortName" = "Käyttäjätunnus";
"password" = "Salasana";
"passwordVerify" = "Vahvista salasana";
"fileSharingAccess" = "Jaon oikeudet";
"accessBelowGuest" = "Annetut tiedostonjaon käyttöoikeudet ovat rajoitetummat kuin vierailijatunnuksella. Tämä käyttäjä voi kirjautua vierailijana ja saada siten oikeuden käyttää jaettuja levyjä.";
"UsernameInUse" = "Tämä käyttäjätunnus on jo olemassa. Anna yksilöivä nimi.";

/*  AAUTimedAccessTask  */

"TimedAccess" = "Ajastetun pääsynhallinnan käyttöönottoapuri";
"TimedAccess.Intro" = "Anna asiakkaan langaton MAC-osoite tai AirPort ID ja kuvaus.";
"TimedAccess.Intro.Fallback" = "Anna kuvaus tämän verkon oletusarvoiselle käyttöoikeusmäärälle.";
"TimedAccess.Restrictions" = "Aseta tämän asiakkaan verkon käyttöaikarajoitukset osoittamalla Lisää (+).";
"TimedAccess.Restrictions.Fallback" = "Aseta verkon oletuskäyttöaikarajoitukset osoittamalla Lisää (+).";
"ThisComputer" = "Tämä tietokone";

"days.0" = "Ei pääsyä";
"days.1" = "Maanantaisin";
"days.2" = "Tiistaisin";
"days.4" = "Keskiviikkoisin";
"days.8" = "Torstaisin";
"days.16" = "Perjantaisin";
"days.32" = "Lauantaisin";
"days.64" = "Sunnuntaisin";
"days.31" = "Arkipäivisin";
"days.96" = "Viikonloppuisin";
"days.127" = "Joka päivä";

"time.0" = "ennen";
"time.1" = "jälkeen";
"time.2" = "välillä";
"time.3" = "koko päivän";

"and" = "ja";

"TimedAccessWillExpireOn" = "Asiakkaan pääsy verkkoon vanhenee %@.";
"TimedAccessDidExpire" = "Asiakkaan pääsy verkkoon on vanhentunut.";	
"TimedAccessDidExpireExplain" = "Jos haluat palauttaa asiakkaan pääsyn verkkoon, vaihda aikarajaksi jokin muu kuin ”Ei pääsyä”.";

/*  AAUDHCPReservationTask  */

"DHCPReservation" = "DHCP-varauksen asetusapuri";
"DHCPReservation.Name" = "Syötä varaukselle nimi";
"DHCPReservation.Name.Intro" = "Jos haluat varata tietyn IP-osoitteen jollekin verkon asiakkaalle, anna varaukselle kuvaus.";
"DHCPReservation.Name.Middle" = "Varaa osoite MAC-osoitteen tai DHCP-asiakastunnuksen perusteella.";
"DHCPReservation.Name.Continue"	= "Osoita Jatka kun olet valmiina.";
"DHCPReservation.Mapping" = "Yhdistä asiakastunnus tai MAC-osoite tiettyyn IP-osoitteeseen";
"DHCPReservation.Mapping.MACAddress" = "Syötä MAC-osoite langattomalle asiakkaalle, joka saa varauksen.";
"DHCPReservation.Mapping.ClientID" = "Syötä DHCP-asiakastunnus langattomalle asiakkaalle, joka saa varauksen.";
"DHCPReservation.Mapping.IP" = "Syötä IP-osoite, jonka haluat varata asiakkaalle. Varattu osoite annetaan vain asiakkaalle, jonka MAC-osoite tai DHCP-asiakastunnus vastaa annettua.";
"DHCPReservation.Mapping.Done"	= "Osoita Valmis kun olet valmiina.";

"macAddress" = "MAC-osoite";
"clientID" = "DHCP-asiakastunnus";
"ipv4Address" = "IPv4-osoite";
"ReserveAddressBy" = "Varaa osoitteet";

/*  AAUSimpleConfigTask  */

"WPS" = "Langattomien asiakkaiden määrittelyapuri";
"WPS.Auth.Intro" = "Voit sallia asiakkaan liittyä salasanasuojattuun verkkoon salasanaa syöttämättä kahdella tavalla. Voit syöttää käyttäjälle PIN-koodin tai sallia ensimmäisen liittymistä yrittävän asiakkaan liittyä.";
"WPS.Auth.DayPass" = "Voit rajoittaa asiakkaan pääsyn 24 tuntiin.";

"WPS.PIN.Intro" = "Syötä asiakkaan PIN-koodi.";
"WPS.PIN.Description" = "PIN-koodi näytetään asiakkaan näytöllä tai on kirjoitettu laitteeseen, jos asiakkaalla ei ole näyttöä.";

"WPS.Done.Intro" = "Kun langaton asiakas liittyy verkkoon, se näkyy alla.";
"WPS.Done.Waiting" = "Odotetaan langatonta asiakasta…";
"WPS.Done.Failed" = "Langattoman asiakkaan yrittäessä liittyä verkkoon tapahtui virhe. Yritä uudelleen.";
"WPS.Done.Success" = "Uusi langaton asiakas liittyi verkkoon.";

"AllowClientsBy" = "Salli asiakas perusteella";
"PIN" = "PIN-koodi";
"FirstCome" = "Ensimmäinen yritys";
"DayPass" = "Rajoita asiakkaan pääsy 24 tuntiin";

/* AAUWirelessOptionsTask */

"WirelessOptions" = "Langattoman verkon valinnat";

/* AAUBaseStationOptionsTask */

"BaseStationOptions" = "Valinnat";

/* AAUBaseStationHostnameTask */

"BaseStationHostname" = "Palvelinnimi";
"BaseStationHostnames" = "Palvelinnimet";

/* AAUEditDualChannelsTask */

"EditDualChannels" = "Radiokanavat";

"AppleWiFiConnectOptions" = "Langattoman asiakkaan valinnat";

/* EditUSBDeviceTask */
"EditUSBDevice" = "USB-laite";

"USBDeviceSharingAccounts" = "Tilit";
"USBDeviceSharingAccounts.title" = "Valitse tilit";
"AddNewAccount" = "Lisää uusi tili";
"SaveAccount" = "Tallenna tili";

"USBDeviceIsExclusive" = "Tätä laitetta voi käyttää yksi asiakas kerrallaan";

"USBDeviceSharing" = "Käyttörajoitukset";
"USBDeviceSharing.0" = "Ei rajoituksia";
"USBDeviceSharing.1" = "Käytä kohteen ”%@” salasanaa";	/* product name goes here */
"USBDeviceSharing.2" = "Käytä USB-laitteen salasanaa";
"USBDeviceSharing.3" = "Käytä tilejä";

/* WaitForDirectConnectTask */

"WaitForDirectConnectTask" = "Liitä vanha Time Capsule";
"WaitForDirectConnectTask.replacecables" = "Siirrä kaikki ethernet-kaapelit vanhasta Time Capsulesta uuteen Time Capsuleen.";
"WaitForDirectConnectTask.directdescription" = "Jos haluat optimoida siirtymisen, liitä ethernet-kaapeli vanhan Time Capsulen WAN-portista uuden Time Capsulen LAN-porttiin.";
"WaitForDirectConnectTask.initialcheck" = "Tarkistetaan, onko Time Capsule liitetty ethernetillä…";
"WaitForDirectConnectTask.ok1" = "Time Capsulet on nyt liitetty.";
"WaitForDirectConnectTask.ok2" = "Aloita siirtyminen osoittamalla Jatka.";
"WaitForDirectConnectTask.ok3" = "Siirtyminen saattaa kestää pitkään siirrettävän levyn sisällöstä riippuen.";
"WaitForDirectConnectTaskOldLabel" = "Vanha Time Capsule";
"WaitForDirectConnectTaskNewLabel" = "Uusi Time Capsule";

/* VerifyInternetConnection */

"VerifyInternetConnectionTitle" = "Tarkistetaan internet-yhteyttä";
"VerifyInternetConnectionTest" = "AirPort-työkalu varmistaa, että tämä %@ on yhteydessä internetiin.";
"VerifyInternetConnectionTestSuccess" = "Tämä %@ on yhteydessä internetiin. Osoita Jatka.";
"VerifyInternetConnectionTestFailure" = "Jos haluat käyttää internet-yhteyttä siirtymisen aikana, varmista, että DSL- tai kaapelimodeemi on liitetty uuden Time Capsulen WAN-porttiin. Laita modeemi pois päältä, irrota siinä mahdollisesti oleva paristo, odota pari sekuntia ja laita modeemi takaisin päälle. Kun yhteys on muodostettu, osoita Jatka.";
"VerifyInternetConnectionTestFailureIgnore" = "Jos et halua käyttää internet-yhteyttä siirtymisen aikana, osoita Jatka.";

